* Test Inline Code of Org babel python
#+begin_src python :results output

  def greeting():
      msg = "Thank you Jesus!!!"
      return msg

  print greeting()


#+end_src

#+RESULTS:
: Thank you Jesus!!!

* Test Javascript now:
#+begin_src js :results output
    console.log("Hello");

    var util = require("util");
  console.log("this is a Node.js test program!");
  
#+end_src

#+RESULTS:
: Hello
: this is a Node.js test program!

* * Test emacs-lisp now:
#+begin_src emacs-lisp :results echo
  (message '"Hello!")
#+end_src

#+RESULTS:
: Hello!
 
